#include"interface.h"

void Interface::menu()
{
	 cout<<"========================================="<<endl;
     cout<<"                 用户登陆                "<<endl;
	 cout<<"-----------------------------------------"<<endl;
	 cout<<"          【1】 管理员登陆               "<<endl;
	 cout<<"          【2】  教师登陆                "<<endl;
	 cout<<"          【0】   退 出                  "<<endl;
	 cout<<"========================================="<<endl;
	 cout<<"              请输入您的选择：";    
}

void Interface::menu1()
{
    cout<<"=========================================="<<endl;
	cout<<"             【1】专业管理                "<<endl;
	cout<<"             【2】班级管理                "<<endl;
	cout<<"             【0】 退 出                  "<<endl;
	cout<<"=========================================="<<endl;
	cout<<"            请选择您的操作：";
}

void Interface::menu2()
{
    cout<<"=========================================="<<endl;
	cout<<"             【1】学生管理                "<<endl;
	cout<<"             【2】查询管理                "<<endl;
	cout<<"             【3】排序管理                "<<endl;
	cout<<"             【4】统计管理                "<<endl;
	cout<<"             【0】 退 出                  "<<endl;
	cout<<"=========================================="<<endl;
	cout<<"            请输入您的操作：";
}

void Interface::menu3()
{
   cout<<"==========================================="<<endl;
   cout<<"              学生信息管理菜单             "<<endl;
   cout<<"-------------------------------------------"<<endl;
   cout<<"         【1】添加学生基本信息             "<<endl;
   cout<<"         【2】根据学号修改学生信息         "<<endl;
   cout<<"         【3】根据姓名修改学生信息         "<<endl;
   cout<<"         【4】根据学号查询学生信息         "<<endl;
   cout<<"         【5】根据学号删除学生信息         "<<endl;
   cout<<"         【6】批量输入学生成绩             "<<endl;
   cout<<"         【0】退回上一级菜单               "<<endl;
   cout<<"==========================================="<<endl;
   cout<<"               请输入您的操作：";
}

void Interface::menu4()
{
   cout<<"=============================================="<<endl;
   cout<<"              学生信息查询管理菜单            "<<endl;
   cout<<"----------------------------------------------"<<endl;
   cout<<"             【1】查询全部本科生              "<<endl;
   cout<<"             【2】查询全部研究生              "<<endl;
   cout<<"             【3】按班级查询                  "<<endl;
   cout<<"             【4】按专业查询                  "<<endl;
   cout<<"             【5】按姓名查询                  "<<endl;
   cout<<"             【6】按学号查询                  "<<endl;
   cout<<"             【7】显示某班级、某科目不及格的名单"<<endl;
   cout<<"             【0】退回上一级菜单              "<<endl;
   cout<<"==============================================="<<endl;
   cout<<"               请输入您的操作：";
}

void Interface::menu5()
{
   cout<<"==============================================="<<endl;
   cout<<"              学生信息排序管理菜单             "<<endl;
   cout<<"-----------------------------------------------"<<endl;
   cout<<"              【1】排序全部本科生              "<<endl;
   cout<<"              【2】排序全部研究生              "<<endl;
   cout<<"              【3】排序本科生班级的学生        "<<endl;
   cout<<"              【4】排序研究生班级的学生        "<<endl;
   cout<<"              【0】退回上一级菜单              "<<endl;
   cout<<"==============================================="<<endl;
   cout<<"                 请输入您的操作：";
}

void Interface::menu6()
{
	cout<<"==============================================="<<endl;
	cout<<"              学生信息统计管理菜单             "<<endl;
	cout<<"-----------------------------------------------"<<endl;
	cout<<"        【1】统计平均成绩、最高和最低成绩      "<<endl;
	cout<<"        【2】统计某班级超过平均分的人数和名单  "<<endl;
	cout<<"        【3】统计某班级某科目不及格的人数和名单"<<endl;
	cout<<"        【4】统计某班级某科目不同等级的学生人数"<<endl;
    cout<<"        【0】     退回上一级菜单               "<<endl;
	cout<<"==============================================="<<endl;
	cout<<"                请输入您的操作：";
}

void Interface::menu7(int n)
{
     if(n==1)
		 cout<<"       专业编号      专业名称           "<<endl;
	 else if(n==2)
		 cout<<"       专业编号      专业名称         班级编号      班级名称          "<<endl;
	 else if(n==3)
		 cout<<"    学号  名字  性别  专业编号  班级编号  专业名称  班级名称  C语言成绩  高数成绩  英语成绩  总成绩  班级排名  年级排名"<<endl;
	 else if(n==4)
		 cout<<"    学号  名字  性别  专业编号  班级编号  专业名称  班级名称  课程设计成绩  论文成绩  总成绩  班级排名  年级排名"<<endl;
}

void Interface::menu8()  //动态菜单
{
    cout<<"===================================="<<endl;
	cout<<"               管理菜单             "<<endl;
	cout<<"------------------------------------"<<endl;
	cout<<"         【1】 删除专业信息         "<<endl;
	cout<<"         【2】 修改专业信息         "<<endl;
	cout<<"         【0】    退 出             "<<endl;
	cout<<"===================================="<<endl;
	cout<<"            请输入您的选择：";
}